**학** **사** **지** **원** **과**


## 2025학년도 2학기
# 종합강의 시간표


#### 인재상[교육목표]






















|인재상|세부<br>인재상|Col3|핵심역량|정의|구성요인|
|---|---|---|---|---|---|
|ARI형<br>인재|A형|실천<br>인재|의사소통|듣기, 말하기, 읽기, 쓰기 능력을 바탕으로 타인과 사회를 공감<br>및 이해하며 상호교류 하는 능력|수용력, 표현력, 공감력|
|ARI형<br>인재|A형|실천<br>인재|리더십|자기개발 및 원만한 대인 관계를 바탕으로 공동체의 비전과 목표<br>를 설정하여 이를 성공적으로 달성하도록 이끄는 능력|자기주도성, 협동능력,<br>상대이해능력, 중재능력|
|ARI형<br>인재|R형|인성<br>인재|인성/영<br>성|기독교 정신을 바탕으로 사람과 사회에 대해 사람과 봉사의 마음<br>을 가지고 책임을 다하는 능력|도덕성, 배려, 자기성찰,<br>관용|
|ARI형<br>인재|I형|창의<br>인재|융합실무|전공에 대해 전문성과 타 학문에 대한 이해 및 개방적 태도를 바<br>탕으로 여러 분야의 지식 및 기술을 통합하여 실무에 적용하는<br>능력|통합적사고능력,<br>실제응용능력|
|ARI형<br>인재|I형|창의<br>인재|글로벌|외국어 구사능력을 바탕으로 한 다문화 이해력과 글로벌 비지니<br>스에 필요한 지식, 기술 및 태도|외국어구사능력,<br>다문화이해능력|
|ARI형<br>인재|I형|창의<br>인재|문제해결|비판적, 분석적, 종합적 사고력을 바탕으로 다양한 형태의 정보를<br>해석, 가공, 적용하며 새로운 지식과 가치를 창출할 수 있는 능력|분석적, 종합적 사고능력,<br>지식생성능력|


###### 차   례

-----------------------------------------2025학년도 학사일정 5


-----------------------------------------수강신청 필독사항 안내 7


-----------------------------------------수강신청일정 11


필수과목안내 입학년도 별 교양 및 전공 필수과목 안내 ----------- 15


-----------------------------------------28
졸업학점안내


-----------------------------------------31
전공별트랙안내


-----------------------------------------32
(계열별) 자유전공 안내


-----------------------------------------35
소단위 전공과정


-----------------------------------------36
자기설계부전공


-----------------------------------------37
연계전공교육과정


-----------------------------------------39
몰입학기 수강안내


40
주요학사제도안내 성적경고, 졸업, 경인지역 학점교류


---------------------교양 KCU컨소시엄 수강안내 42


---------------------OCU컨소시엄 수강안내 44


--------------대학e-러닝 컨소시엄 수강안내 48


-----------------------------------------현장실습(인턴십) 50


-----------------------------------------사회봉사 수강안내 51


-----------------------------------------교직안내 52


-----------------------------------------유사(동일)과목 안내 57


-----------------------------------------대체과목 안내 75


-----------------------------------------교양폐지과목 안내 87


-----------------------------------------교양교육과정체계 90


-----------------------------------------교양교육과정 91


시간표 안내


-----------------------------------------교양필수 및 선택(안양 주간) 101


-----------------------------------------교양필수 및 선택(안양 야간) 106


-----------------------------------------교양필수 및 선택(강화캠퍼스) 108


-----------------------------------------소단위 전공과정 110


-----------------------------------------교직 111


                      - 3 

##### 2025학년도 학사일정







































|월|요 일|Col3|Col4|Col5|Col6|Col7|Col8|일 정|내 용|
|---|---|---|---|---|---|---|---|---|---|
|월|일|월|화|수|목|금|토|토|토|
|2025년<br>3월|2<br>9<br>16<br>23<br>30|3<br>10<br>17<br>24<br>31|4<br>11<br>18<br>25|5<br>12<br>19<br>26|6<br>13<br>20<br>27|7<br>14<br>21<br>28|1<br>8<br>15<br>22<br>29|03.01(토)<br>03.03(월)<br>03.04(화)<br>03.04(화)~03.07(금)<br>03.04(화)~03.07(금)<br>03.04(화)~03.10(월)<br>03.07(금)~03.13(목)<br>03.25(화)~03.26(수)<br>03.30(일)|삼일절<br>삼일절 대체휴일<br>1학기 개강<br>조기졸업 신청 기간<br>2차 일반휴학 신청 기간<br>2차 수강정정 기간<br>전액 2차 등록 기간<br>수강철회 기간<br>학기시작 30일|
|4월|6<br>13<br>20<br>27|7<br>14<br>21<br>28|1<br>8<br>15<br>22<br>29|2<br>9<br>16<br>23<br>30|3<br>10<br>17<br>24|4<br>11<br>18<br>25|5<br>12<br>19<br>26|04.22(화)~04.28(월)<br>04.29(화)|수시고사 기간<br>학기시작 60일|
|5월|4<br>11<br>18<br>25|5<br>12<br>19<br>26|6<br>13<br>20<br>27|7<br>14<br>21<br>28|1<br>8<br>15<br>22<br>29|2<br>9<br>16<br>23<br>30|3<br>10<br>17<br>24<br>31|05.05(월)<br>05.06(화)<br>05.07(수)~05.09(금)<br>05.07(수)~05.16(금)<br>05.21(수)~05.22(목)<br>05.23(금)<br>05.29(목)|어린이날,부처님오신날<br>부처님오신날 대체휴일<br>수료자 졸업 신청 기간<br>중간강의평가 및 수시고사 성적 확인<br>체육대회<br>수업주수 3/4선<br>학기시작 90일|
|6월|1<br>8<br>15<br>22<br>29|2<br>9<br>16<br>23<br>30|3<br>10<br>17<br>24|4<br>11<br>18<br>25|5<br>12<br>19<br>26|6<br>13<br>20<br>27|7<br>14<br>21<br>28|06.06(금)<br>06.10(화)∼06.16(월)<br>06.10(화)~06.20(금)<br>06.16(월)<br>06.23(월)<br>06.24(화)~06.27(금)<br>06.24(화)~07.04(금)|현충일<br>기말고사 기간<br>성적입력 기간<br>1학기 종강<br>하계 계절수업 개강<br>성적확인 및 정정 기간<br>강의평가 기간|
|7월|6<br>13<br>20<br>27|7<br>14<br>21<br>28|1<br>8<br>15<br>22<br>29|2<br>9<br>16<br>23<br>30|3<br>10<br>17<br>24<br>31|4<br>11<br>18<br>25|5<br>12<br>19<br>26|07.07(월)~07.11(금)<br>07.11(금)<br>07.14(월)~07.18(금)<br>07.14(월)~07.25(금)<br>07.17(목)~07.18(금)|재입학 신청 기간<br>하계 계절수업 종강<br>부·복·연계·자기설계전공 및 전과 신청<br>휴학 및 복학 신청 기간<br>졸업연기 신청 기간|
|8월|3<br>10<br>17<br>24<br>31|4<br>11<br>18<br>25|5<br>12<br>19<br>26|6<br>13<br>20<br>27|7<br>14<br>21<br>28|1<br>8<br>15<br>22<br>29|2<br>9<br>16<br>23<br>30|08.14(목)<br>08.15(금)<br>08.18(월)~08.21(목)<br>08.22(금)<br>08.22(금)~08.28(목)|대학원 후기 학위수여식<br>광복절<br>2학기 수강신청 기간<br>1차 수강정정 기간<br>전액 1차 등록기간|



 - 5 

2. 교양필수 소개


채플(Chapel)(Pass 과목)-신학대학


신학부 학생들을 위한 경건회는 매주 드리는 신학부 예배와 매 학기 초 실시되는 영성훈련, 성경고사, 교


회봉사 실습평가서를 포함하며, 이것들을 통해 기독교적 세계관을 소유한 영적 지도자들로 자선을 준비하


여, 하나님 앞에서 삶을 구체화하며, 참된 영성을 추구하도록 한다. 모든 경건회 프로그램은 75%이상의


출석과 일정 수준 이상의 객관적인 자질을 요구한다.


채플(Chapel)(Pass 과목)-일반대학


매주 드리는 교목실 주관의 예배는 안양대학교의 설립 정신인 기독교 정신을 배우도록 하며, 나아가 기독


교 세계관을 지닌 평신도 지도자들로 준비되도록 함을 목표로 하고, 경건 예배는 75% 이상의 출석을 요


구한다.


구약개요(Introduction to the Old Testament)
구약성경 연구를 위한 기본적인 내용들을 숙지하도록 한다. 특히 구약성경 각 책과 주제에 따른 언급과


함께 구약을 학문적으로 접근하기 위한 다양한 접근방법, 학문적인 분류와 분야, 그에 따른 포괄적인 이


해와 함께 전통적인 구약관을 갖도록 한다.


신약개요(Introduction to the New Testament)


신학을 배울 학생들이 기본적으로 알아야 할 신약성경의 내용을 개관함으로써 기독교 신학을 수학할 기틀


을 놓는다. 동시에 신약성경을 연구하는 데 필요한 기초 작업도 다진다.


기독교개론(The introduction of Christianity)


기독교를 어떻게 이해 할 것인가? 역사를 해석 할때 기독교 신앙을 표출해야 하는가? 아니면 숨겨야 하


는가? 본과목은 이러한 문제의식을 가지고 기독교 개념과 역사관을 탐구하는 가운데 기독교 바른 이해와


사관의 위치 그 타당성을 제시 한다.


사고와표현(Thinking and Expression)


본 강좌는 학생들의 표현능력(쓰기, 말하기)을 체계적으로 개발하는 데 그 목적이 있다. 현실에서 대두되


는 다양한 문제에 대하여 합리적이고 창의적인 관점으로 사고하며 말과 글을 통해 이를 타인에게 효과적


이고 설득력 있게 전달하는 표현능력을 함양시키는 것을 목표로 한다. 비판적이고 창의적인 사고와 표현


능력을 통해 현대 사회가 요구하는 교양인, 아름다운 리더로 학생들을 육성하는데 본 교과의 의의가 있


다.


아리진로탐색과대학생활(Ari Career Exploring and Campus Life)


대학 신입생들이 1학년 시절부터 진로에 대해 관심을 갖고 자신의 진로를 탐색하고 개발하도록 지원하는


교과이다. 이를 위해 본 교과는 자기탐색, 진로탐색, 진로체험 그리고 진로계획의 내용들로 구성되어 있으


며 학생 참여형 수업으로 진행된다.


아리진로상담과창의융합기업가정신


(Ari Career Counseling and Creative Conversion Entrepreneurship)


본 교과는 1학기에 ‘아리 진로탐색과 대학생활’을 수강한 1학년 학생들이 지속적으로 자신의 진로에 대해


관심을 갖고 체계적인 진로개발을 할 수 있도록 지원하는 실무형 교과이다. 특히 4차 산업시대의 도래와


함께 개개인의 창의융합적인 사고를 요하는 직업분야의 확대가 예상되면서 학생 개개인의 소질, 적성, 흥


미가 주도하는 진로개발이 더욱 필요하다는 인식 하에 본 교과는 학생들의 진로개발 지원을 위한 집단상


                       - 20 

14. 교원자격을 발급을 위한 필수 이수과목


가 . 교직과목














































|구분|학년|교과목명|학점|대상학과|개설학기 및 시간|Col7|비고|
|---|---|---|---|---|---|---|---|
|구분|학년|교과목명|학점|대상학과|1학기|2학기|2학기|
|교직<br>이론|2|교육학개론<br>교육철학및교육사<br>교육심리<br>생활지도및상담|2<br>2<br>2<br>2|유교<br>기교<br>일반교직<br>유교<br>기교<br>일반교직<br>유교<br>기교<br>일반교직<br>기교,<br>일반교직|2<br>2<br>2<br>2<br>2|2<br>2<br>2<br>2<br>2|7과목 중<br>6과목(12학점)<br>이상 필수|
|교직<br>이론|3|교육과정<br>교육방법및교육공학|2<br>2|유교<br>기교<br>일반교직<br>유교<br>기교<br>일반교직|2<br>2<br>2<br>2|2<br>2|2<br>2|
|교직<br>이론|4|교육사회|2|유교<br>기교<br>일반교직|2<br>2<br>2|||
|교직<br>이론|계|계|14학점|14학점|14학점|14학점|14학점|
|교직<br>소양|2|특수아동의 이해|3|유교<br>기교<br>일반교직|3|3<br>3|4과목<br>(6학점 이상)<br>필수|
|교직<br>소양|2|디지털교육|2|유교<br>기교<br>일반교직||2<br>2<br>2|2<br>2<br>2|
|교직<br>소양|3|교직실무<br>학교폭력예방및학생의이해|2<br>2|유교<br>기교<br>일반교직<br>유교<br>기교<br>일반교직|2<br>2|2<br>2<br>2<br>2|2<br>2<br>2<br>2|
|교직<br>소양|계|계|||9학점|9학점||
|교육<br>실습|4|학교현장실습<br>교육봉사활동|2<br>2|유교,기교<br>일반교직<br>유교,기교<br>일반교직|2<br>2|2|필수|
|교육<br>실습|계|계|4학점|4학점|4학점|4학점|4학점|
|표시<br>과목<br>교과교<br>육영역<br>(전공)|3|교과교육론<br>교과교재연구및지도법|3<br>3|일반교직<br>일반교직|3|3|필수|
|표시<br>과목<br>교과교<br>육영역<br>(전공)|4|논리및논술|3|일반교직|3|||
|표시<br>과목<br>교과교<br>육영역<br>(전공)|계|계|9학점|9학점|9학점|9학점|9학점|



※2024학년도 이후 입학자는 교직 소양 디지털교육 포함하여 4과목(6학점이상) 필수로 이수하여야 함


                         - 55 

유사과목은 기존과목과 변경된 과목의 내용이 동일한 교과목으로 기존 과목을 수강하고 변경된 과목을 신청할 경우


「대체수강」으로 표기되며 기존과목이 재수강처리 되므로 수강신청 시 유의하기 바랍니다.


Ⅰ. 교양필수





















|기존과목|적용년도|변경된 과목|
|---|---|---|
|현대영어강독[통신, 컴퓨터, 환경(08-09),<br> 디지털미디어학과(08-09)]|2007-<br>2009|영어회화Ⅰ|
|영어회화[통신, 컴퓨터, 환경(08-09),<br> 디지털미디어학과(08-09)]|2007-<br>2009|영어회화Ⅱ|
|대학물리학및실험Ⅰ|2007-<br>2011|대학물리학Ⅰ|
|창의탐구<br>일러스트레이터디자인|2014<br>2016|일러스트레이터디자인<br>창업지식재산개론|
|영어회화I|2017|ESP:Critical Thinking|
|영어회화II|2017|ESP:Creative Thinking|
|공동체시민과현장봉사프로젝트|2021|자기계발과 Life DESIGN|


Ⅱ. 교양선택

|기존과목|적용년도|변경된 과목|
|---|---|---|
|English Through games|2009|Active English|
|Understanging World Regional Studies|2009|Understanding world Regional StudiesⅠ|
|Virtual world tour|2009|Understanding world Regional StudiesⅡ|
|기업과환경|2010|사회적기업|
|증권투자|2010|증권투자론Ⅰ|
|증권투자상담사Ⅱ|2010|증권투자론Ⅱ|
|토론의이론과실제Ⅰ,Ⅱ|2010|토론의이론과실제|
|현대음악의이해|2010|음악과현대인의이해|
|동양화기초표현Ⅰ|2011|동양화기초표현|
|동양화기초표현Ⅱ|2011|문인화기초표현|
|영문강독|2012|영문강독Ⅰ|
|영문독해|2012|영문강독Ⅱ|
|영문법연습Ⅰ|2012|초급영문법|
|영문법연습Ⅱ|2012|중급영문법|
|음악과인생|2012|음악으로찾는인생|
|초급불어회화Ⅰ|2012|프랑스어맛보기|
|초급불어회화Ⅱ|2012|프랑스어말하기|
|APP(앱)|2013|모바일앱|
|공연예술과영상매체실습|2013|공연예술과영상매체|
|생활한국어|2013|대학한국어(IntermediateKorean)|
|수화|2013|수화이해와실제|
|식품과건강|2013|건강과삶|
|앱(APP)|2013|모바일앱|
|영작문Ⅰ,Ⅱ|2013|초급영작문Ⅰ,Ⅱ|
|재무관리|2013|재무관리의이론과실제|



                         - 57 

